; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	image0 - mode
	spectrograph3 - mode
	infrared1 - mode
	image2 - mode
	image4 - mode
	infrared5 - mode
	GroundStation3 - direction
	Star4 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared5)
	(supports instrument0 spectrograph3)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star2)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument3 image4)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument4 infrared1)
	(supports instrument4 image4)
	(supports instrument4 image0)
	(supports instrument4 image2)
	(calibration_target instrument4 Star2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
)
(:goal (and
	(pointing satellite0 Planet8)
	(have_image Star5 infrared1)
	(have_image Star6 spectrograph3)
	(have_image Star6 image4)
	(have_image Star7 spectrograph3)
	(have_image Star7 infrared1)
	(have_image Planet8 infrared1)
	(have_image Planet9 image2)
	(have_image Planet9 image4)
	(have_image Planet10 image2)
	(have_image Planet10 infrared5)
	(have_image Star11 infrared5)
	(have_image Phenomenon12 image4)
	(have_image Planet13 image4)
	(have_image Planet13 image0)
))

)

; plan
1. (turn_to satellite2 star2 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star2)
   goals met: 0 of 15
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 15
3. (calibrate satellite2 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 0 of 15
4. (turn_to satellite2 planet13 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet13)
   goals met: 0 of 15
5. (take_image satellite2 planet13 instrument4 image4)
   added: (have_image planet13 image4)
   goals met: 1 of 15
6. (take_image satellite2 planet13 instrument4 image0)
   added: (have_image planet13 image0)
   goals met: 2 of 15
7. (turn_to satellite2 planet10 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet10)
   goals met: 2 of 15
8. (take_image satellite2 planet10 instrument4 image2)
   added: (have_image planet10 image2)
   goals met: 3 of 15
9. (turn_to satellite2 phenomenon12 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon12)
   goals met: 3 of 15
10. (turn_to satellite0 star2 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star2)
   goals met: 3 of 15
11. (take_image satellite2 phenomenon12 instrument4 image4)
   added: (have_image phenomenon12 image4)
   goals met: 4 of 15
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 15
13. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 4 of 15
14. (turn_to satellite0 planet10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet10)
   goals met: 4 of 15
15. (take_image satellite0 planet10 instrument0 infrared5)
   added: (have_image planet10 infrared5)
   goals met: 5 of 15
16. (turn_to satellite0 star11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star11)
   goals met: 5 of 15
17. (take_image satellite0 star11 instrument0 infrared5)
   added: (have_image star11 infrared5)
   goals met: 6 of 15
18. (turn_to satellite0 star5 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star5)
   goals met: 6 of 15
19. (take_image satellite0 star5 instrument0 infrared1)
   added: (have_image star5 infrared1)
   goals met: 7 of 15
20. (turn_to satellite0 star6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star6)
   goals met: 7 of 15
21. (take_image satellite0 star6 instrument0 spectrograph3)
   added: (have_image star6 spectrograph3)
   goals met: 8 of 15
22. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 8 of 15
23. (take_image satellite0 star7 instrument0 infrared1)
   added: (have_image star7 infrared1)
   goals met: 9 of 15
24. (take_image satellite0 star7 instrument0 spectrograph3)
   added: (have_image star7 spectrograph3)
   goals met: 10 of 15
25. (turn_to satellite0 planet8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet8)
   goals met: 11 of 15
26. (take_image satellite0 planet8 instrument0 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 12 of 15
27. (turn_to satellite2 planet9 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 planet9)
   goals met: 12 of 15
28. (take_image satellite2 planet9 instrument4 image2)
   added: (have_image planet9 image2)
   goals met: 13 of 15
29. (take_image satellite2 planet9 instrument4 image4)
   added: (have_image planet9 image4)
   goals met: 14 of 15
30. (turn_to satellite2 star6 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star6)
   goals met: 14 of 15
31. (take_image satellite2 star6 instrument4 image4)
   added: (have_image star6 image4)
   goals met: 15 of 15
